#Область ПрограммныйИнтерфейс

//Доработано 09.09.2026, ДЗ_Командная работа (EDT) ((
Процедура ДополнитьФорму(Форма) Экспорт
	//Дополнение форм документов полем ввода "Контактное лицо"
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
		ДобавитьРеквизитСогласованнаяСкидкаИКомандуПересчитать(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	КонецЕсли;
	
КонецПроцедуры
//))Конец Доработано 09.09.2026

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//Доработано 09.09.2026, ДЗ_Командная работа (EDT) ((
Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма)
	//Добавление поля ввода "Контактное лицо" в группу формы "ГруппаШапкаПраво"
	
	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";
	
КонецПроцедуры

Процедура ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма)
	//Добавление поля ввода "КонтактноеЛицо" перед полем ввода "Сумма документа"
	
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"),, Форма.Элементы.СуммаДокумента);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";
	
КонецПроцедуры

Процедура ДобавитьРеквизитСогласованнаяСкидкаИКомандуПересчитать(Форма)
	//Добавление реквизита формы "Согласованная скидка" и команды "Пересчитать"
	ГруппаШапкаЛево = Форма.Элементы.ГруппаКолонкиШапки.ПодчиненныеЭлементы.ГруппаШапкаЛево;
	
	ГруппаСкидка = Форма.Элементы.Добавить("ДЗ2_ГруппаСкидка", Тип("ГруппаФормы"), ГруппаШапкаЛево);
	ГруппаСкидка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСкидка.ОтображатьЗаголовок = Ложь;
	ГруппаСкидка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	Скидка = Форма.Элементы.Добавить("ДЗ_СогласованнаяСкидка", Тип("ПолеФормы"), ГруппаСкидка);
	Скидка.Вид = ВидПоляФормы.ПолеВвода;
	Скидка.ПутьКДанным = "Объект.ДЗ_СогласованнаяСкидка";
	Скидка.УстановитьДействие("ПриИзменении", "ДЗ_СогласованнаяСкидкаПриИзменении");
	
	ПересчитатьТаблицы = Форма.Команды.Добавить("ДЗ2_ПересчитатьТаблицы");
	ПересчитатьТаблицы.Заголовок = "Пересчитать";
	ПересчитатьТаблицы.Действие = "ДЗ2_ПересчитатьТаблицы";
	ПересчитатьТаблицы.ИзменяетСохраняемыеДанные = Истина;
	
	КнопкаПересчитатьТаблицы = Форма.Элементы.Добавить("ДЗ2_ПересчитатьТаблицы", Тип("КнопкаФормы"), ГруппаСкидка);
	КнопкаПересчитатьТаблицы.ИмяКоманды = "ДЗ2_ПересчитатьТаблицы";
	КнопкаПересчитатьТаблицы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	КнопкаПересчитатьТаблицы.Отображение = ОтображениеКнопки.КартинкаИТекст;
	КнопкаПересчитатьТаблицы.Картинка = БиблиотекаКартинок.Обновить;
	
КонецПроцедуры
//))Конец Доработано 09.09.2026

#КонецОбласти