#Область ОбработчикиСобытий

//Доработано 09.09.2026, ДЗ_Командная работа (EDT)((
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	//Получение представления объекта из реквизитов справочника "Наименование", "ДействуетНаОсновании"
	
	Если ЗначениеЗаполнено(Данные.ДействуетНаОсновании) Тогда
		СтандартнаяОбработка = Ложь;
		
		ШаблонПредставления = "%1 (на осн. %2)";
		Представление = СтрШаблон(ШаблонПредставления, Данные.Наименование, Данные.ДействуетНаОсновании);
	Иначе
		Представление = Данные.Наименование;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	//Определение реквизитов справочника, из которых будет получено представление объекта
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Наименование");
	Поля.Добавить("ДействуетНаОсновании");
	
КонецПроцедуры
//))Конец Доработано 09.09.2026

#КонецОбласти
